[
    [
        {
            "speaker" : "macbeth",
            "dialog" : "If it were done when 'tis done, then 'twere well It were done quickly: ",
            "newSpeaker" : "aye"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "If the assassination could trammel up the consequence, and catch with his surcease success; that but this blow might be the be-all and the end-all here,"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "But here, upon this bank and shoal of time, we'ld jump the life to come."
        },
        {
            "speaker" : "macbeth",
            "dialog" : "But in these cases we still have judgment here;"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "that we but teach bloody instructions, which, being taught, return to plague the inventor:"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "this even-handed justice commends the ingredients of our poison'd chalice to our own lips."
        },
        {
            "speaker" : "macbeth",
            "dialog" : "He's here in double trust; first, as I am his kinsman and his subject, strong both against the deed;"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "then, as his host, who should against his murderer shut the door, not bear the knife myself."
        },
        {
            "speaker" : "macbeth",
            "dialog" : "Besides, this Duncan hath borne his faculties so meek, "
        },
        {
            "speaker" : "macbeth",
            "dialog" : "hath been so clear in his great office, that his virtues will plead like angels, trumpet-tongued, against the deep damnation of his taking-off;"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "And pity, like a naked new-born babe, striding the blast, or heaven's cherubim,"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "horsed upon the sightless couriers of the air, shall blow the horrid deed in every eye, that tears shall drown the wind."
        },
        {
            "speaker" : "macbeth",
            "dialog" : "I have no spur to prick the sides of my intent, but only vaulting ambition, which o'erleaps itself and falls on the other."
        }
    ],
    [
        {
            "speaker" : "ladymacbeth",
            "dialog" : "What's up bitches",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "How now, what news?",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "He has almost supp'd: why have you left the chamber?",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "Hath he ask'd for me?",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "Know you not he has?",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "We will proceed no further in this business:",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "He hath honour'd me of late; and I have bought golden opinions from all sorts of people, which would be worn now in their newest gloss, not cast aside so soon."
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "Was the hope drunk wherein you dress'd yourself?"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "hath it slept since?"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "And wakes it now, to look so green and pale at what it did so freely?"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "From this time such I account thy love. Art thou afeard to be the same in thine own act and valour as thou art in desire?"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "Wouldst thou have that which thou esteem'st the ornament of life,"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" :  "and live a coward in thine own esteem, letting 'I dare not' wait upon 'I would,' like the poor cat i' the adage?"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "Prithee, peace: I dare do all that may become a man; who dares do more is none.",
            "newSpeaker" : "true"
        },

        {
            "speaker" : "ladymacbeth",
            "dialog" : "What beast was't, then, that made you break this enterprise to me?",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "When you durst do it, then you were a man; and, to be more than what you were, you would be so much more the man."
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "Nor time nor place did then adhere, and yet you would make both: they have made themselves, and that their fitness now does unmake you."
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "I have given suck, and know how tender 'tis to love the babe that milks me:"
        },
        {
            "speaker" : "ladymacbeth",
            "dialog" : "I would, while it was smiling in my face, have pluck'd my nipple from his boneless gums, and dash'd the brains out, had I so sworn as you have done to this."
        },
        {
            "speaker" : "macbeth",
            "dialog" : "...",
            "newSpeaker" : "true"
        },
        {
            "speaker" : "macbeth",
            "dialog" : "....."
        },
        {
            "speaker" : "macbeth",
            "dialog" : "damn bitch you crazy"
        }
    ]
]